{
  "backend/main.mo": "Motoko actor storing promo video requests in a map with create, lookup, and list operations.",
  "feature_evidence.json": "Feature evidence file mapping features to related frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Text file containing prewritten summaries for all key frontend components, hooks, and styles.",
  "frontend/index.css": "Tailwind base layer defining OKLCH color variables for light and dark modes and global styling.",
  "frontend/index.html": "Basic HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main React component orchestrating all sections, theme setup, and request form state.",
  "frontend/src/components/ExamplesGallery.tsx": "Renders a grid of six example promotional video cards with images, titles, and descriptions.",
  "frontend/src/components/FAQSection.tsx": "Accordion-based FAQ section displaying eight questions and answers about the service.",
  "frontend/src/components/Footer.tsx": "Renders the website footer with branding, navigation links, social icons, and dynamic year/app identifier.",
  "frontend/src/components/HeroSection.tsx": "Displays the main hero banner with background image, headline, CTA buttons, and key stats.",
  "frontend/src/components/HowItWorksSection.tsx": "Shows a four‑step process with icons and descriptions explaining how the service works.",
  "frontend/src/components/IndustriesSection.tsx": "Lists supported industries using cards with icons, titles, and descriptions.",
  "frontend/src/components/MarketingHeader.tsx": "Implements a responsive header with scroll effects, navigation links, CTA button, and a mobile menu.",
  "frontend/src/components/PricingSection.tsx": "Displays pricing plans with features, highlighting the most popular option and linking to the request section.",
  "frontend/src/components/RequestConfirmation.tsx": "Shows a confirmation card with a reference ID, copy button, next steps, and option to submit another request.",
  "frontend/src/components/RequestPromoVideoForm.tsx": "Form component that collects promo video request details, validates input, and submits data via a mutation hook.",
  "frontend/src/components/RequestSection.tsx": "Section wrapper that displays either the promo request form or a confirmation message based on state.",
  "frontend/src/components/Section.tsx": "Reusable layout component that renders a styled section with optional ID and custom classes.",
  "frontend/src/components/ServicesSection.tsx": "Displays a list of service cards describing video production features within a themed section.",
  "frontend/src/hooks/useActor.ts": "Hook that initializes and manages a backend actor based on Internet Identity authentication, invalidating dependent queries on changes.",
  "frontend/src/hooks/useCreatePromoVideoRequest.ts": "Mutation hook that formats form data and sends a create request to the backend, generating a unique reference ID.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and provider managing Internet Identity authentication state, login, logout, and identity loading.",
  "frontend/src/hooks/useQueries.ts": "Query hooks for fetching all promo video requests or a single request using the backend actor.",
  "frontend/src/index.css": "Global Tailwind-based styles defining color variables, typography, and utility classes for light and dark themes.",
  "frontend/src/main.tsx": "Application entry that sets up React Query, Internet Identity provider, and renders the root component.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, color tokens, animations, and plugin integration.",
  "project_state.json": "Defines project metadata, required images, and a list of implemented website features for the VlogunrealPromo marketing site."
}