{
  "kind": "build_request",
  "title": "Fix portfolio video playback and robust URL/thumbnail handling",
  "projectName": "VlogunrealPromo",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-17",
      "text": "Fix portfolio video playback by making YouTube URL parsing robust so common YouTube formats (including youtu.be links, youtube.com/watch?v=, youtube.com/shorts/, youtube.com/embed/, and links with extra query parameters) correctly produce an embeddable iframe URL in the portfolio viewer modal.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Can’t see the video on portfolio"
        ]
      },
      "acceptanceCriteria": [
        "Given a portfolio item whose url is a YouTube watch link (https://www.youtube.com/watch?v=VIDEO_ID), clicking its card opens the viewer modal and displays an iframe player.",
        "Given a portfolio item whose url is a youtu.be short link (https://youtu.be/VIDEO_ID), clicking its card opens the viewer modal and displays an iframe player.",
        "Given a portfolio item whose url is a YouTube Shorts link (https://www.youtube.com/shorts/VIDEO_ID), clicking its card opens the viewer modal and displays an iframe player.",
        "Given a portfolio item whose url is a YouTube embed link (https://www.youtube.com/embed/VIDEO_ID), clicking its card opens the viewer modal and displays an iframe player.",
        "Given a YouTube link containing extra parameters (e.g., &t=123), the correct VIDEO_ID is still extracted and the embed player is shown."
      ]
    },
    {
      "id": "REQ-18",
      "text": "Add resilient thumbnail fallbacks in the portfolio grid cards and viewer fallback state so broken/missing thumbnail URLs do not result in an empty/blank video card; instead show a visually neutral placeholder and keep the card clickable.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Can’t see the video on portfolio"
        ]
      },
      "acceptanceCriteria": [
        "If a portfolio item thumbnailUrl fails to load in the Created Videos grid, a placeholder image/state is shown in the same aspect ratio (no broken-image icon), and the rest of the card (title/description) remains visible.",
        "If a YouTube auto-derived thumbnail (maxresdefault) fails to load, the UI attempts a simpler YouTube thumbnail variant (e.g., hqdefault) or falls back to a placeholder.",
        "No console errors are thrown during image fallback handling."
      ]
    },
    {
      "id": "REQ-19",
      "text": "Improve the Created Video viewer modal fallback UX when a video cannot be embedded: display a clear English message explaining that the video cannot be embedded and provide a prominent \"Open Video in New Tab\" action that always works.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Can’t see the video on portfolio"
        ]
      },
      "acceptanceCriteria": [
        "When getEmbedUrl(video.url) returns null, the viewer modal shows a readable English message indicating the video cannot be embedded and includes an external link button that opens the original video URL in a new tab.",
        "The fallback state still displays a thumbnail (or placeholder if thumbnail fails) in a consistent aspect-video container.",
        "User-facing text in this fallback state is in English."
      ]
    }
  ],
  "constraints": [
    "Respect the existing single-actor backend architecture; no new canisters/services.",
    "Do not edit files under frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, or anything in frontend/src/components/ui (compose instead of modifying)."
  ],
  "nonGoals": [
    "Do not add new portfolio features (e.g., filtering, categories, pagination) beyond fixing visibility/playback.",
    "Do not introduce new third-party video providers beyond the existing YouTube/Vimeo parsing.",
    "Do not change backend data models or access control as part of this fix unless strictly required to make playback work."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}