{
  "kind": "build_request",
  "title": "Create VlogunrealPromo marketing website with promo-video request submission",
  "projectName": "VlogunrealPromo",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Create a responsive marketing website for the brand name “VlogunrealPromo” that targets Restaurants, Hotels, and similar businesses looking for AI promotional videos.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "VlogunrealPromo Ke Naam Se Website Banaao Jo Restaurants, Hotels, Etc Brands Ke Liye Ai Promotional Video"
        ]
      },
      "acceptanceCriteria": [
        "The site prominently displays the name “VlogunrealPromo”.",
        "The site clearly communicates that the service is AI promotional videos for Restaurants/Hotels/etc.",
        "All user-facing UI text is in English."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Implement core site sections/pages: Hero, Services/What you get, Industries (Restaurants/Hotels/etc), How it works, Pricing (informational only), Examples/Portfolio gallery, FAQ, and Contact/Request CTA.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Website ... for ... Brands ... Ai Promotional Video"
        ]
      },
      "acceptanceCriteria": [
        "Navigation provides access (via sections or routes) to Services, Industries, How it works, Pricing, Examples, FAQ, and Contact/Request.",
        "Each section has clear headings and concise explanatory copy in English.",
        "A clear CTA (e.g., “Request a Promo Video”) is visible above the fold and near the bottom of the page."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Add a “Request a Promo Video” form that collects lead details and requirements, including: business name, business type (Restaurant/Hotel/Other), contact name, email, phone/WhatsApp, location (city/country), website/social links, desired video length, desired style/mood, language, deadline (date), budget range, and free-text notes.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "... Brands Ke Liye Ai Promotional Video"
        ]
      },
      "acceptanceCriteria": [
        "Form includes all specified fields.",
        "Client-side validation blocks submission when required fields are missing or invalid (e.g., email format).",
        "On success, the UI shows a clear confirmation message and a submission/reference ID."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Persist promo-video requests in the Motoko backend canister with stable storage and expose an API to create a new request and fetch a request by its reference ID.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "... Brands Ke Liye Ai Promotional Video"
        ]
      },
      "acceptanceCriteria": [
        "A Motoko type exists to represent a promo request with all form fields plus createdAt timestamp and a generated reference ID.",
        "Submitted requests are stored in stable state and survive canister upgrades.",
        "Backend exposes a method to create a request and returns the generated reference ID.",
        "Backend exposes a method to fetch request details by reference ID."
      ]
    },
    {
      "id": "REQ-5",
      "text": "Connect the frontend form submission to the backend using the project’s actor integration and manage submission state with React Query (loading, success, error).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Website ... Ai Promotional Video"
        ]
      },
      "acceptanceCriteria": [
        "Submitting the form calls the backend create-request method.",
        "While submitting, the UI shows a loading state and prevents duplicate submissions.",
        "On error, the UI shows an English error message and allows retry.",
        "On success, the returned reference ID is shown to the user."
      ]
    },
    {
      "id": "REQ-6",
      "text": "Add an “Examples” gallery section that showcases multiple promotional video concepts using static thumbnail cards (title, short description, and image).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "... Promotional Video"
        ]
      },
      "acceptanceCriteria": [
        "Examples section displays at least 6 example cards.",
        "Cards are responsive (grid layout adjusts from mobile to desktop).",
        "Each card includes an image, a title, and a 1–2 line description in English."
      ]
    },
    {
      "id": "REQ-7",
      "text": "Apply a coherent, distinctive visual theme appropriate for a premium promo-video studio: cinematic dark neutrals with warm accents (avoid blue/purple), modern typography, and consistent spacing/components across all sections.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "VlogunrealPromo ... Website"
        ]
      },
      "acceptanceCriteria": [
        "Theme uses a consistent palette dominated by dark neutrals with warm accents (e.g., gold/coral) and does not rely on blue/purple as primary branding.",
        "Typography hierarchy is consistent (headings, body, buttons).",
        "Buttons, cards, and section layouts look cohesive across the site."
      ]
    },
    {
      "id": "REQ-8",
      "text": "Add a static assets integration to render the generated brand images (logo/wordmark/hero/examples) from frontend/public/assets/generated and use them in the appropriate sections (header/hero/examples).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "VlogunrealPromo Ke Naam Se Website"
        ]
      },
      "acceptanceCriteria": [
        "Generated images are referenced as static assets (not served via backend).",
        "Header/hero includes the logo/wordmark.",
        "Hero uses the hero background image.",
        "Examples gallery uses the provided thumbnail images."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor (no multi-canister backend architecture).",
    "Do not edit files under frontend/src/components/ui or other immutable paths listed in SYSTEM_CONTEXT; compose them instead.",
    "No third-party authentication providers; only Internet Identity is allowed if authentication is later added.",
    "No external databases; all persistence must be in Motoko stable storage."
  ],
  "nonGoals": [
    "Implementing actual AI video generation or integrating with external AI/LLM/video services.",
    "Uploading/hosting large media files directly in the app (collect links instead).",
    "Payments/checkout (e.g., Stripe) and order fulfillment workflows.",
    "Admin dashboard/CRM features for managing leads (unless requested later)."
  ],
  "imageRequirements": {
    "required": [
      "Minimal cinematic logo mark, abstract camera/film motif, dark background variant (vlogunrealpromo-logo.dim_512x512.png)",
      "Wide wordmark lockup “VlogunrealPromo” in a modern cinematic style (vlogunrealpromo-wordmark.dim_1200x300.png)",
      "Cinematic hero background illustration with subtle film/grain lighting, no text (vlogunrealpromo-hero-bg.dim_1600x900.png)",
      "Promotional video thumbnail image: Restaurant concept, cinematic food/ambient lighting (example-thumb-restaurant.dim_800x450.png)",
      "Promotional video thumbnail image: Hotel concept, luxury interior lighting (example-thumb-hotel.dim_800x450.png)",
      "Promotional video thumbnail image: Cafe concept, cozy warm tones (example-thumb-cafe.dim_800x450.png)"
    ],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [
      "Use English for all user-facing UI text in the app."
    ],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}