{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix portfolio video playback and resilient thumbnail/fallback UX",
  "requirements": [
    {
      "id": "REQ-17",
      "summary": "Make YouTube URL parsing robust across common formats to reliably produce an embeddable iframe URL in the portfolio viewer modal.",
      "acceptanceCriteria": [
        "Given a portfolio item whose url is a YouTube watch link (https://www.youtube.com/watch?v=VIDEO_ID), clicking its card opens the viewer modal and displays an iframe player.",
        "Given a portfolio item whose url is a youtu.be short link (https://youtu.be/VIDEO_ID), clicking its card opens the viewer modal and displays an iframe player.",
        "Given a portfolio item whose url is a YouTube Shorts link (https://www.youtube.com/shorts/VIDEO_ID), clicking its card opens the viewer modal and displays an iframe player.",
        "Given a portfolio item whose url is a YouTube embed link (https://www.youtube.com/embed/VIDEO_ID), clicking its card opens the viewer modal and displays an iframe player.",
        "Given a YouTube link containing extra parameters (e.g., &t=123), the correct VIDEO_ID is still extracted and the embed player is shown."
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/videoUrls.ts",
          "operation": "modify",
          "description": "Harden YouTube ID extraction to support youtube.com/watch (v=), youtu.be/<id>, youtube.com/shorts/<id>, youtube.com/embed/<id>, and other common path-based formats while ignoring extra query params; ensure getEmbedUrl returns a correct YouTube embed URL when possible."
        },
        {
          "path": "frontend/src/components/CreatedVideoViewer.tsx",
          "operation": "modify",
          "description": "Ensure the viewer modal uses the updated getEmbedUrl() behavior so valid YouTube URLs consistently render an iframe in the modal using existing shadcn/ui Dialog components (Verify the component's usage instructions before implementing)."
        }
      ]
    },
    {
      "id": "REQ-18",
      "summary": "Add resilient thumbnail fallbacks for portfolio grid cards and viewer so missing/broken thumbnails never yield blank cards and remain clickable; attempt YouTube thumbnail variants when maxres fails.",
      "acceptanceCriteria": [
        "If a portfolio item thumbnailUrl fails to load in the Created Videos grid, a placeholder image/state is shown in the same aspect ratio (no broken-image icon), and the rest of the card (title/description) remains visible.",
        "If a YouTube auto-derived thumbnail (maxresdefault) fails to load, the UI attempts a simpler YouTube thumbnail variant (e.g., hqdefault) or falls back to a placeholder.",
        "No console errors are thrown during image fallback handling."
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/videoUrls.ts",
          "operation": "modify",
          "description": "Add helper(s) to produce an ordered list of YouTube thumbnail candidate URLs for a given video ID (e.g., maxresdefault then hqdefault and other safe variants), and optionally expose a utility to derive candidates from a full video URL."
        },
        {
          "path": "frontend/src/components/VideoThumbnail.tsx",
          "operation": "create",
          "description": "Create a reusable thumbnail component that preserves an aspect-video container, cycles through candidate thumbnail URLs on image load failure (including YouTube maxres -> hq fallback when applicable), and finally shows a neutral placeholder without emitting console errors."
        },
        {
          "path": "frontend/src/components/CreatedVideosSection.tsx",
          "operation": "modify",
          "description": "Replace the raw <img> in portfolio grid cards with the new VideoThumbnail component so broken/missing thumbnails render a neutral placeholder while keeping the card clickable and content visible; keep existing shadcn/ui Card composition (Verify the component's usage instructions before implementing)."
        },
        {
          "path": "frontend/src/components/CreatedVideoViewer.tsx",
          "operation": "modify",
          "description": "Use VideoThumbnail in the viewer’s non-embed fallback area so the modal always shows a consistent aspect-video thumbnail/placeholder even if thumbnail URLs fail."
        },
        {
          "path": "frontend/src/components/VideoUrlPreview.tsx",
          "operation": "modify",
          "description": "Adopt VideoThumbnail for the admin preview’s non-embed path and remove ad-hoc onError reassignment so thumbnail fallback behavior is consistent and does not produce console errors; keep existing shadcn/ui Card composition (Verify the component's usage instructions before implementing)."
        }
      ]
    },
    {
      "id": "REQ-19",
      "summary": "Improve viewer modal fallback UX when a video cannot be embedded by showing a clear English message and a prominent 'Open Video in New Tab' action that always works.",
      "acceptanceCriteria": [
        "When getEmbedUrl(video.url) returns null, the viewer modal shows a readable English message indicating the video cannot be embedded and includes an external link button that opens the original video URL in a new tab.",
        "The fallback state still displays a thumbnail (or placeholder if thumbnail fails) in a consistent aspect-video container.",
        "User-facing text in this fallback state is in English."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/CreatedVideoViewer.tsx",
          "operation": "modify",
          "description": "Update the non-embed branch to include an explicit English explanation that the video cannot be embedded, keep a consistent aspect-video media container (using VideoThumbnail), and render a prominent shadcn/ui Button-as-link that opens the original video URL in a new tab (Verify the component's usage instructions before implementing)."
        }
      ]
    }
  ]
}